let media = gataVidMenu.getRandom()
let handler = async (m, { conn, command }) => {
let fkontak = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
let str = ` 𝐁𝐄𝐌𝐁𝐈𝐍𝐃𝐎𝐒(𝘼) 𝐀𝐎𝐒 𝐂𝐇𝐀𝐓𝐒 𝐎𝐅𝐈𝐂𝐈𝐀𝐈𝐒

 𝐀𝐒𝐒𝐈𝐌 𝐐𝐔𝐄 𝐄𝐍𝐓𝐑𝐀𝐑 𝐋𝐄𝐈𝐀 𝐀 𝐃𝐄𝐒𝐂𝐑𝐈𝐂̧𝐀̃𝐎
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
𝐋𝐈𝐊𝐒 𝐃𝐎𝐒 𝐌𝐄𝐔𝐒 𝐂𝐇𝐀𝐓𝐒. 🤖 𝐁𝐎𝐓𝐒 𝐎𝐍 24 𝐇𝐑𝐒. 🤖

𝙄 𝐂𝐇𝐀𝐓𝐒 𝐃𝐎 𝐁𝐈𝐆. 👽 𝐂𝐎𝐌𝐌𝐔𝐍𝐘𝐓 𝐁𝐈𝐆 𝐒𝐏𝐘 👽. 
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
𓃠 *𝐕𝐄𝐑𝐒𝐀̃𝐎 𝐃𝐄 ${gt}*
➥ ${vs}
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
✅ 𝐆𝐑𝐔𝐏𝐎 𝐎𝐅𝐂 ${gt}
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
👾 *𝐈𝐍𝐅𝐎 𝐃𝐀𝐒 𝐍𝐎𝐕𝐈𝐃𝐀𝐃𝐄𝐒!!!*
⚡ *${channel1}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
⚡ *${channel2}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 
⚡ *${channel3}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🌬️ 𝐒𝐮𝐩𝐨𝐫𝐭𝐞 𝐁𝐢𝐠 𝐒𝐩𝐲
*${nna2}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🌬️ 𝐆𝐫𝐮𝐩𝐨 𝐎𝐟𝐢𝐜𝐢𝐚𝐥 𝟏
*${nn}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🌬️ 𝐆𝐫𝐮𝐩𝐨 𝐎𝐟𝐢𝐜𝐢𝐚𝐥 𝟐
*${nnn}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🌬️ 𝐆𝐫𝐮𝐩𝐨 𝐎𝐟𝐢𝐜𝐢𝐚𝐥 𝟑
*${nnnt}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🌬️ 𝐆𝐫𝐮𝐩𝐨 𝐎𝐟𝐢𝐜𝐢𝐚𝐥 𝟒
*${nnntt}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🌬️ 𝐆𝐫𝐮𝐩𝐨 𝐎𝐟𝐢𝐜𝐢𝐚𝐥 𝟓
*${nnnttt}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
✅ *𝐂𝐎𝐋𝐀𝐁𝐎𝐑𝐀𝐂̧𝐀̃𝐎 𝐂𝐎𝐌* ${gt}
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🤖 𝐁𝐎𝐓 × 𝐒𝐏𝐘 🤖
*${nnnttt1}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🤖 𝐁𝐎𝐓 × 𝐒𝐇𝐀𝐃𝐎𝐖 🤖
*${nnnttt2}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🤖 𝐁𝐎𝐓 × 𝐇𝐀𝐃𝐄𝐒 🤖
*${nnnttt3}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
🤖 𝐁𝐎𝐓 × 𝐂𝐔𝐑𝐈𝐎𝐒𝐈𝐓 🤖
*${nnnttt4}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 
🤖 👾 𝐌𝐔𝐋𝐓𝐈-𝐁𝐎𝐓𝐒 👾 🤖 
*${nnnttt5}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
ᥫ᭡༶A༶T༶M༶M༶ᰔᩚ 
*${nnnttt6}*\n
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
*𝐏𝐎𝐑 𝐅𝐀𝐕𝐎𝐑 𝐍𝐀𝐎 𝐄𝐍𝐓𝐑𝐄 𝐂𝐎𝐌 𝐍𝐔𝐌𝐄𝐑𝐎𝐒 𝐃𝐄 𝐁𝐎𝐓𝐒 𝐄 𝐌𝐀𝐍𝐓𝐄𝐍𝐇𝐀 𝐎 𝐑𝐄𝐒𝐏𝐄𝐈𝐓𝐎.*\n
*𝐂𝐎𝐌𝐌𝐔𝐍𝐘𝐓𝐒 𝐁𝐈𝐆 𝐒𝐏𝐘.*`
await conn.sendFile(m.chat, media, 'gata.mp4', str, fkontak)}
/*conn.sendHydrated(m.chat, str, `𝙂𝘼𝙏𝘼 𝘿𝙄𝙊𝙎 - 𝘼𝙎𝙄𝙎𝙏𝙀𝙉𝘾𝙄𝘼\n${asistencia}\n\n` + wm, media, 'https://github.com/GataNina-Li/GataBot-MD', '𝙂𝙖𝙩𝙖𝘽𝙤𝙩-𝙈𝘿', null, null, [
['𝘾𝙪𝙚𝙣𝙩𝙖𝙨 𝙊𝙛𝙞𝙘𝙞𝙖𝙡𝙚𝙨 | 𝘼𝙘𝙘𝙤𝙪𝙣𝙩𝙨 ✅', '.cuentasgb'],
['🎁 𝘿𝙤𝙣𝙖𝙧 | 𝘿𝙤𝙣𝙖𝙩𝙚', '.donar'],
['𝙑𝙤𝙡𝙫𝙚𝙧 𝙖𝙡 𝙈𝙚𝙣𝙪́ | 𝘽𝙖𝙘𝙠 𝙩𝙤 𝙈𝙚𝙣𝙪 ☘️', '/menu']
], m,)}*/

handler.command = /^linkgc|grupos|gruposgatabot|gatabotgrupos|gruposdegatabot|groupofc|gruposgb|grupogb|groupgb$/i
handler.exp = 33

export default handler
